
Процедура ВКМ_РаботаСТГБотом() Экспорт
	
	//

КонецПроцедуры

#Область СлужебныеПроцедурыИФункции
Процедура СоздатьЗащСоединение() Экспорт

	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	
	ТокенТГ = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); 
	ИДГруппыТГ = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	ЗапросДанные = "bot" + ТокенТГ + "/sendMessage";
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , ЗащищенноеСоединение);
	
	ЗапросHTTP = Новый HTTPЗапрос(ЗапросДанные);
	ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Структура = Новый Структура;
		Структура.Вставить("chat_ID", ИДГруппыТГ);
		Структура.Вставить("text", Выборка.ТекстСообщения);
		
		СтрокаJSON = СтрокаJSON(Структура);
		ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаJSON);
	
		Ответ = Соединение.Получить(ЗапросHTTP);  
	
		Если Ответ.КодСостояния = 200 Тогда
     		
			ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОбъект.Удалить();

		Иначе
    	 	Ошибка = ИнформацияОбОшибке();
    	 	
    	 	ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , 
    	 		ОбработкаОшибок.ПодробноеПредставлениеОшибки(Ошибка));
		
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

Функция СтрокаJSON(Структура)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	ЗаписьJSON.Закрыть();
	
	Возврат Структура;
	
КонецФункции
#КонецОбласти	