

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.УИД = Новый УникальныйИдентификатор();
	Объект.ПериодНачало = НачалоМесяца(ТекущаяДата());
	Объект.ПериодКонец = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	СоздатьАкты()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьАкты()
	
	ДлитОпер = НачатьДО(Объект.ПериодНачало, КонецДня(Объект.ПериодКонец), Объект.УИД);
	
	ПарамОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПарамОжидания.Заголовок = "Формирую акты";
	ПарамОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПарамОжидания.Интервал = 2;
	ПарамОжидания.ВыводитьСообщения = Истина;
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлитОпер, Оповещение, ПарамОжидания);
	
КонецПроцедуры	

&НаСервере
Функция НачатьДО(ПериодНачало, ПериодКонец, УникальныйИдентификатор)
	
	СформироватьАкты(ПериодНачало, ПериодКонец);
	ПарамВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПарамВыполнения, "СформироватьАкты", ПериодНачало, ПериодКонец)
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
	
	КолВоАктов = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
	ОбщегоНазначенияКлиент.СообщитьПользователю("Создано " + КолВоАктов 
	+ " актов"); 
	ОбновитьОтображениеДанных();
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	
КонецПроцедуры	

&НаСервере
Функция СформироватьАкты(ПериодНачало, ПериодКонец)
	
	КолВоАктов = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.Организация КАК Организация,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.ВКМ_СуммаАбонентскойПлаты КАК ДоговорВКМ_СуммаАбонентскойПлаты,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, 0) КАК Ссылка,
	|	РеализацияТоваровУслуг.ПометкаУдаления
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&НачалоПериода, &КонецПериода,,
	|		Договор.ВидДоговора = &ВидДоговора) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = РеализацияТоваровУслуг.Договор";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодНачало);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ПериодКонец);
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если  НЕ Выборка.ПометкаУдаления И Выборка.Ссылка <> 0 Тогда
			
			ТабЧасть = Объект.СписокДокументов.Добавить();
			ТабЧасть.Договоры = Выборка.Договор;
			ТабЧасть.Реализации = Выборка.Ссылка;
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Акт для %1 за период уже создан.", Выборка.Клиент));
		
		ИначеЕсли Выборка.Ссылка = 0 Или Выборка.Ссылка <> 0 И Выборка.ПометкаУдаления Тогда
		
			НовыйАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			НовыйАкт.Дата = КонецДня(Объект.ПериодКонец);
			НовыйАкт.Организация = Выборка.Организация;
			НовыйАкт.Контрагент = Выборка.Клиент;
			НовыйАкт.Договор = Выборка.Договор;
			НовыйАкт.Комментарий = "Создано автоматически при помощи обработки";
			НовыйАкт.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйАкт.Записать();
		
			НовыйАкт.ВыполнитьАвтозаполнение();
			НовыйАкт.Записать();
		 
			НовыйАкт.ПроверитьЗаполнение();
			НовыйАкт.Записать(РежимЗаписиДокумента.Проведение);
		
			ТабЧасть = Объект.СписокДокументов.Добавить();
			ТабЧасть.Договоры = НовыйАкт.Договор;
			ТабЧасть.Реализации = НовыйАкт.Ссылка;
		
			КолВоАктов = КолВоАктов + 1;
		 
		
		КонецЕсли;
		
	КонецЦикла;
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(КолВоАктов);
	
	Возврат АдресВХранилище;
	
КонецФункции	
#КонецОбласти