

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ПериодНачало = НачалоМесяца(ТекущаяДата());
	Объект.ПериодКонец = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	СоздатьАкты()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьАкты()
	
	ДлитОпер = НачатьДО();
		
	Оповещение = Новый ОписаниеОповещения("ПриЗавершенииДлительнойОперации", ЭтотОбъект);
	
	ПарамОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПарамОжидания.Заголовок = "Формирую акты";
	ПарамОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПарамОжидания.Интервал = 2;
	ПарамОжидания.ВыводитьСообщения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлитОпер, Оповещение, ПарамОжидания);
	
КонецПроцедуры	

&НаСервере
Функция НачатьДО()  
		
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьАкты", 
		Объект.ПериодНачало, Объект.ПериодКонец);
	
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииДлительнойОперации(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда 
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки; 
	КонецЕсли;
		
	Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Акты созданы %1 шт., обработка завершена", Результат));	
	
	ЗаполнитьДаннымиТЧ();

	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьДаннымиТЧ()
	
	Объект.СписокДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РеализацияТоваровУслуг.Договор КАК Договор
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
	               |	И РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора";  
	
	Запрос.УстановитьПараметр("ПериодНачало", Объект.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(Объект.ПериодКонец));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Выборка = Запрос.Выполнить().Выбрать();    
	
	Пока Выборка.Следующий() Цикл   
		
		ТабЧасть = Объект.СписокДокументов.Добавить(); 
		ТабЧасть.Договоры = Выборка.Договор;
		ТабЧасть.Реализации = Выборка.Ссылка;
		
	КонецЦикла;	
	
КонецПроцедуры	


#КонецОбласти