
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

//ВКМ_Комарчева
//Автозаполнение

Процедура ВыполнитьАвтозаполнение() Экспорт
	
	//получить номенклатуру из констант НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста, 
	НоменкАбонПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменкРабСпец = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	//если хотя бы одна не заполнена, необходимо выдать ошибку и прекратить выполнение процедуры,
	Если Не ЗначениеЗаполнено(НоменкАбонПлата) Или Не ЗначениеЗаполнено(НоменкРабСпец) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнена номенклатура! Заполнение невозможно.");
		//очистить табличную часть.
		Услуги.Очистить();
		Товары.Очистить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;	

Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.КоличествоЧасовОборот, 0) КАК ВыполненнаяРабота,
|	ЕСТЬNULL(ВКМ_ВыполненныеКлиентуРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате
|ИЗ
|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
|		ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = ДоговорыКонтрагентов.Ссылка";

Результат = Запрос.Выполнить().Выбрать();
Пока Результат.Следующий() Цикл
	//Если в договоре ненулевая сумма абонентской платы, добавьте в табличную часть строку с номенклатурой из константы 
//НоменклатураАбонентскаяПлата и суммой абонентской платы из договора.
	Если Результат.СуммаАбонентскойПлаты <> 0 Тогда 
		СтрокаНоменклатуры = Услуги.Добавить();
		СтрокаНоменклатуры.Номенклатура = НоменкАбонПлата;
		СтрокаНоменклатуры.Сумма = Результат.СуммаАбонентскойПлаты;
	КонецЕсли;
	
	Если Результат.ВыполненнаяРабота <> 0 Тогда
		//Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация о выполненных работах 
//по этому договору, добавьте в табличную часть строку с номенклатурой из константы 
//НоменклатураРаботыСпециалиста и общим количеством и суммой из регистра ВыполненныеКлиентуРаботы за месяц документа.
		СтрокаНоменклатуры = Услуги.Добавить();
		СтрокаНоменклатуры.Номенклатура = НоменкРабСпец;
		СтрокаНоменклатуры.Количество = Результат.ВыполненнаяРабота;
		СтрокаНоменклатуры.Сумма = Результат.СуммаКОплате;
	КонецЕсли;
	
КонецЦикла;


	
КонецПроцедуры

//Конец

#КонецОбласти

#КонецЕсли
