
#Область ОбработчикиСобытийФормы

//&НаСервере
//Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	ПосчитатьДни();
//КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	
	ПосчитатьДни();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	 
	ПосчитатьДни();
	 
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьДиаграммуГанта(Команда)
	
	АдресВХранилище = ДиаграммаГантаЗаполнитьНаСервере();
	ПарамФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПарамФормы);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере		
Функция ДиаграммаГантаЗаполнитьНаСервере()
	
	ВыгружаемаяТЧ = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания");
	Адрес = ПоместитьВоВременноеХранилище(ВыгружаемаяТЧ);
	Возврат Адрес;
	
КонецФункции		

&НаСервере
Процедура ПосчитатьДни()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаДни = Запрос.Выполнить().Выбрать();
		
	Пока ВыборкаДни.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаДни.ДатаНачала) Или Не ЗначениеЗаполнено(ВыборкаДни.ДатаОкончания)
			Тогда Возврат;
		КонецЕсли;
		
		Количество = (ВыборкаДни.ДатаОкончания - ВыборкаДни.ДатаНачала) / 86400;
		
		Если Количество > 28 Тогда
			Элемент = УсловноеОформление.Элементы.Добавить();
			
			ЭлОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Количество);
			ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
			ЭлОтбора.ПравоеЗначение = 28;
			ЭлОтбора.Использование = Истина;
			
			Элемент.Использование = Истина;
			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
			
			Поля = Элемент.Поля.Элементы.Добавить();
			Поля.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтпускаСотрудниковСотрудник);
			Поля.Использование = Истина;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
