
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПосчитатьДни();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПосчитатьДни();

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ПосчитатьДни();

КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьДиаграммуГанта(Команда)
	
	АдресВХранилище = ДиаграммаГантаЗаполнитьНаСервере();
	ПарамФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПарамФормы);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере		
Функция ДиаграммаГантаЗаполнитьНаСервере()
	
	ВыгружаемаяТЧ = Объект.ОтпускаСотрудников.Выгрузить(,"Сотрудник, ДатаНачала, ДатаОкончания");
	Адрес = ПоместитьВоВременноеХранилище(ВыгружаемаяТЧ);
	Возврат Адрес;
	
КонецФункции		

&НаСервере
Процедура ПосчитатьДни()
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Не ЗначениеЗаполнено(Строка.ДатаНачала) Или Не ЗначениеЗаполнено(Строка.ДатаОкончания)
			Тогда Строка.КоличествоДней = 0;
		Иначе
		Строка.КоличествоДней = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
		КонецЕсли;
		
	КонецЦикла;	
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	ТаблицаОтпусков.Свернуть("Сотрудник", "КоличествоДней");
	
	СоответствиеДнейПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из ТаблицаОтпусков Цикл
    	Сотрудник = СтрокаТаблицы.Сотрудник;
   		СуммарныеДни = СтрокаТаблицы.КоличествоДней;
    СоответствиеДнейПоСотрудникам[Сотрудник] = СуммарныеДни;
	КонецЦикла;

	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
    	СотрудникТекущейСтроки = Строка.Сотрудник;
    Если СоответствиеДнейПоСотрудникам.Получить(СотрудникТекущейСтроки) Тогда
        Строка.КоличествоДней = СоответствиеДнейПоСотрудникам[СотрудникТекущейСтроки];
    Иначе
        Строка.КоличествоДней = 0; 
    КонецЕсли;
КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
