#Область СлужебныеПроцедурыИФункции 

Функция СоздатьАкты(ПериодНачало, ПериодКонец) Экспорт  
	
	Результат = ПолучитьДанныеДляАктов(ПериодНачало, ПериодКонец);	
	Возврат Результат;
				
КонецФункции	

Функция ПолучитьДанныеДляАктов(ПериодНачало, ПериодКонец)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Клиент КАК Клиент,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор КАК Договор,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.Организация КАК Организация,
	|	ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор.ВКМ_СуммаАбонентскойПлаты КАК ДоговорВКМ_СуммаАбонентскойПлаты,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	РеализацияТоваровУслуг.ПометкаУдаления
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(&ПериодНачало, &ПериодКонец,,
	|		Договор.ВидДоговора = &ВидДоговора) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВКМ_ВыполненныеКлиентуРаботыОбороты.Договор = РеализацияТоваровУслуг.Договор
	|		И РеализацияТоваровУслуг.Дата МЕЖДУ &ПериодНачало И &ПериодКонец
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КолВоАктов = 0;
	
	Если Выборка.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Акты за период уже созданы."); 
	Иначе	
		Пока Выборка.Следующий() Цикл	
			
//			Если Выборка.ПометкаУдаления Тогда 
//				Акт = Выборка.Реализация;
//				Акт.ВыполнитьАвтозаполнение();
//				Акт.Записать();
//				Акт.ПроверитьЗаполнение();
//				Акт.ПометкаУдаления = Ложь;
//				Акт.Записать(РежимЗаписиДокумента.Проведение);
//			КонецЕсли;	
			
			НовыйАкт = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			
			НовыйАкт.Дата = КонецДня(ПериодКонец);
			НовыйАкт.Организация = Выборка.Организация;
			НовыйАкт.Контрагент = Выборка.Клиент;
			НовыйАкт.Договор = Выборка.Договор;
			НовыйАкт.Комментарий = "Создано автоматически при помощи обработки";
			НовыйАкт.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НовыйАкт.Записать();
		
			НовыйАкт.ВыполнитьАвтозаполнение();
			НовыйАкт.Записать();
		 
			НовыйАкт.ПроверитьЗаполнение();
			НовыйАкт.Записать(РежимЗаписиДокумента.Проведение); 
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Создан акт для %1", Выборка.Клиент));
			
			КолВоАктов = КолВоАктов + 1;  
		
		КонецЦикла;
							
	КонецЕсли;
		
	Возврат КолВоАктов;
	
КонецФункции 


	#КонецОбласти