#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Адрес = Параметры.АдресВХранилище;
		
	Отпуска = ПолучитьИзВременногоХранилища(Адрес);
	
	ДиаграммаГанта.ОбластьПостроения.Заголовок = "Отпуска сотрудников";
	ЭлементШкалы = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;
	ЭлементШкалыМесяц = ЭлементШкалы.Добавить();
	ЭлементШкалыМесяц.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
	Для Каждого Строка Из Отпуска Цикл
			
		Точка = ДиаграммаГанта.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Серия = ДиаграммаГанта.УстановитьСерию("Отпуск");
		Серия.Цвет = WebЦвета.БледноЗеленый;
		Серия.Текст = "Отпуска";
			
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
	
	КонецЦикла;
КонецПроцедуры


#КонецОбласти
	