
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвижения()
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		//ДопНачисления
		ИтогоЗаВычетомНДФЛ = Строка.СуммаПремии - Строка.СуммаПремии * 13 / 100;
		
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.Размер = Строка.СуммаПремии;
		Движение.Результат = ИтогоЗаВычетомНДФЛ;
		
		//Взаиморасчеты
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.СуммаПремии;
		Движение.Период = Дата;
		
	КонецЦикла;
		
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры
#КонецОбласти	

