#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
	|	РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала, ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания,
	|		День) КАК КолВоДней
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";  
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Резльтат = Запрос.Выполнить().Выбрать();

	// регистр ВКМ_ОтпускаСотрудников 
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	
	Пока Резльтат.Следующий() Цикл
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Резльтат.Сотрудник;
		Движение.ДатаНачала = Резльтат.ДатаНачала;
		Движение.ДатаОкончания = Резльтат.ДатаОкончания;
		Движение.День = Резльтат.КолВоДней;
	КонецЦикла;  
	
	Движения.ВКМ_ОтпускаСотрудников.Записать();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти
