
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СформироватьДвижения();
	РассчитатьОклад();
	РассчитатьОтпуск();
	
	СформироватьДвиженияПоВзаиморачетам();
	СформироваитДвиженияПоПланируемымОтпускам();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвижения()
	
	СформироватьДвиженияПоОкладу();
	СформироватьДвиженияПоОтпуску();
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
КонецПроцедуры

Процедура СформироватьДвиженияПоОкладу()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад);
	
	СтрокиОклада = Начисления.НайтиСтроки(Отбор);
	
	Если СтрокиОклада.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаНачалаДок = СтрокиОклада[0].ДатаНачала;
	ДатаОкончанияДок = СтрокиОклада[0].ДатаОкончания;
	
	Для Сч = 1 По СтрокиОклада.Количество() - 1 Цикл
		
		Если ДатаНачалаДок > СтрокиОклада[Сч].ДатаНачала Тогда
			ДатаНачалаДок = СтрокиОклада[Сч].ДатаНачала;
		КонецЕсли;
		
		Если ДатаОкончанияДок < СтрокиОклада[Сч].ДатаОкончания Тогда
			ДатаОкончанияДок = СтрокиОклада[Сч].ДатаОкончания;
		КонецЕсли;
	КонецЦикла;
	 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания,
	|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета,
	|	ВКМ_НачислениеЗарплатыНачисления.ГрафикРаботы КАК График
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &Оклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
	|ПОМЕСТИТЬ ВТ_ИзмененияОклада
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаНачДок, Сотрудник В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВТ_Периоды.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_Периоды КАК ВТ_Периоды)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудников.Период,
	|	ВКМ_УсловияОплатыСотрудников.Сотрудник,
	|	ВКМ_УсловияОплатыСотрудников.Оклад
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|ГДЕ
	|	ВКМ_УсловияОплатыСотрудников.Период > &ДатаНачДок
	|	И ВКМ_УсловияОплатыСотрудников.Период <= &ДатаОкончДок
	|	И ВКМ_УсловияОплатыСотрудников.Сотрудник В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВТ_Периоды.Сотрудник КАК Сотрудник
	|		ИЗ
	|			ВТ_Периоды КАК ВТ_Периоды)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаНачала.Период КАК ДатаНачала,
	|	ДатаНачала.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ДатаОкончания.Период, СЕКУНДА, -1), ДАТАВРЕМЯ(3999, 12, 31))) КАК ДатаОкончания,
	|	ДатаНачала.Оклад
	|ПОМЕСТИТЬ ВТ_Итервалы
	|ИЗ
	|	ВТ_ИзмененияОклада КАК ДатаНачала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзмененияОклада КАК ДатаОкончания
	|		ПО ДатаНачала.Период < ДатаОкончания.Период
	|		И ДатаНачала.Сотрудник = ДатаОкончания.Сотрудник
	|СГРУППИРОВАТЬ ПО
	|	ДатаНачала.Сотрудник,
	|	ДатаНачала.Период,
	|	ДатаНачала.Оклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.Сотрудник,
	|	ВТ_Периоды.ВидРасчета,
	|	ВТ_Периоды.График КАК График,
	|	ВЫБОР
	|		КОГДА ВТ_Итервалы.ДатаНачала > ВТ_Периоды.ДатаНачала
	|			ТОГДА ВТ_Итервалы.ДатаНачала
	|		ИНАЧЕ ВТ_Периоды.ДатаНачала
	|	КОНЕЦ КАК ПериодДействияНачало,
	|	ВЫБОР
	|		КОГДА ВТ_Итервалы.ДатаОкончания < ВТ_Периоды.ДатаОкончания
	|			ТОГДА ВТ_Итервалы.ДатаОкончания
	|		ИНАЧЕ ВТ_Периоды.ДатаОкончания
	|	КОНЕЦ КАК ПериодДействияКонец,
	|	ВТ_Итервалы.Оклад КАК Показатель
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Итервалы КАК ВТ_Итервалы
	|		ПО ВТ_Периоды.Сотрудник = ВТ_Итервалы.Сотрудник
	|		И ВТ_Итервалы.ДатаНачала <= ВТ_Периоды.ДатаОкончания
	|		И ВТ_Периоды.ДатаНачала <= ВТ_Итервалы.ДатаОкончания";	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка );
	Запрос.УстановитьПараметр("ДатаНачДок", ДатаНачалаДок);	
	Запрос.УстановитьПараметр("ДатаОкончДок", ДатаОкончанияДок);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		
		//Начисления
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.График = Выборка.График;
		Движение.Размер = Выборка.Показатель;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.ПериодДействияНачало = Выборка.ПериодДействияНачало;
		Движение.ПериодДействияКонец = Выборка.ПериодДействияКонец;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура СформироватьДвиженияПоОтпуску()
	
	Для Каждого Строка Из Начисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) <> Тип("ПланВидовРасчетаСсылка.ВКМ_Удержания") Тогда
			Продолжить;
		КонецЕсли;
		//Начисление
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Строка.ДатаНачала;
		Движение.ПериодДействияКонец = Строка.ДатаОкончания;
		Движение.ВидРасчета = Строка.ВидРасчета;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.График = Строка.ГрафикРаботы;
		
		Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_Отпуск Тогда 
			
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Строка.ДатаНачала, - 12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Строка.ДатаОкончания, - 1));
			
		КонецЕсли;	
		
	КонецЦикла;
	
	
КонецПроцедуры	


Процедура РассчитатьОклад()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК Норма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Ссылка
	|	И ВидРасчета = &Оклад) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
			СуммаСНДФЛ = Движение.Размер * Выборка.Факт / Выборка.Норма;
		Движение.Результат = СуммаСНДФЛ - СуммаСНДФЛ * 13/ 100;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры	


Процедура РассчитатьОтпуск()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_Удержания.НомерСтроки,
	|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК БазаОсн,
	|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_Удержания.РезультатБаза, 0) КАК БазаУдержания,
	|	ЕСТЬNULL(ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК БазаДоп,
	|	ЕСТЬNULL(ВКМ_УдержанияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_Удержания(&Измерения, &Измерения,, Регистратор = &Ссылка
	|		И ВидРасчета = &Отпуск) КАК ВКМ_УдержанияБазаВКМ_Удержания
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_Удержания.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,
	|			Регистратор = &Ссылка
	|		И ВидРасчета = &Отпуск) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
	|		ПО ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_Удержания.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения,,
	|			Регистратор = &Ссылка
	|		И ВидРасчета = &Отпуск) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.ДанныеГрафика(Регистратор = &Ссылка
	|		И ВидРасчета = &Отпуск) КАК ВКМ_УдержанияДанныеГрафика
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_УдержанияДанныеГрафика.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ПО ВКМ_Удержания.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
	|ГДЕ
	|	ВКМ_Удержания.ВидРасчета = &Отпуск
	|	И ВКМ_Удержания.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_Удержания.ВКМ_Отпуск);
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Начисления
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		
		ВсеНачисленияЗаГод = Выборка.БазаОсн + Выборка.БазаДоп + Выборка.БазаУдержания;
		НачисленоОтпуск = ВсеНачисленияЗаГод / Выборка.План * Выборка.Факт;
		
		Движение.Результат = НачисленоОтпуск;
		
	КонецЦикла;		
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры	

Процедура СформироватьДвиженияПоВзаиморачетам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник,
	|	ВКМ_ОсновныеНачисления.Результат,
	|	ВКМ_ОсновныеНачисления.ВидРасчета
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_Удержания.Сотрудник,
	|	ВКМ_Удержания.Результат,
	|	ВКМ_Удержания.ВидРасчета
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад Или 
			Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия Тогда
		
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			
		ИначеЕсли Выборка.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_Отпуск Тогда
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЕсли;
			
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Сумма = Выборка.Результат;
			Движение.Период = Дата;
		
	КонецЦикла;	
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
КонецПроцедуры

Процедура СформироваитДвиженияПоПланируемымОтпускам()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
	|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
	|	РАЗНОСТЬДАТ(ВКМ_НачислениеЗарплатыНачисления.ДатаНачала, ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания, День) КАК
	|		ДнейКолВо
	|ИЗ
	|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
	|ГДЕ
	|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета",ПланыВидовРасчета.ВКМ_Удержания.ВКМ_Отпуск); 
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
		Движение.Период = Дата;
		Движение.Сотрудник = Результат.Сотрудник;
		Движение.ДатаНачала = Результат.ДатаНачала;
		Движение.ДатаОкончания = Результат.ДатаОкончания; 
		Движение.День = Результат.ДнейКолВо;
		
	КонецЦикла;
	
	Движения.ВКМ_ОтпускаСотрудников.Записать();
	
КонецПроцедуры	


#КонецОбласти
