
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ВКМ_Комарчева
	//Создание новых элементов
	СоздатьЭлементыФормы();
	//Конец

КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	СоздатьЭлементыФормы();

КонецПроцедуры

//ВКМ_Комарчева
//Создание новых элементов
&НаСервере
Процедура СоздатьЭлементыФормы()
	
	Если Не ЗначениеЗаполнено(Объект.ВидДоговора) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание")
		Тогда 
			
			ГруппаПериод = Элементы.Добавить("ГруппаПериодДействия", Тип("ГруппаФормы"));
			ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			ГруппаПериод.Заголовок = "Период действия договора";
			ГруппаПериод.ОтображатьЗаголовок = Истина;
			
			НовоеПолеПериодНачало = Элементы.Добавить("ВКМ_НачалоДействияДоговора", Тип("ПолеФормы"), ГруппаПериод);
			НовоеПолеПериодНачало.Вид = ВидПоляФормы.ПолеПериода;
			НовоеПолеПериодНачало.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
			НовоеПолеПериодНачало.Заголовок = "с";
			
			НовоеПолеПериодКонец = Элементы.Добавить("ВКМ_КонецДействияДоговора", Тип("ПолеФормы"), ГруппаПериод);
			НовоеПолеПериодКонец.Вид = ВидПоляФормы.ПолеПериода;
			НовоеПолеПериодКонец.ПутьКДанным = "Объект.ВКМ_КонецДействияДоговора";
			НовоеПолеПериодКонец.Заголовок = "по";
			
			НовоеПолеСумма = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
			НовоеПолеСумма.Вид = ВидПоляФормы.ПолеВвода;
			НовоеПолеСумма.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			
			НовоеПолеСтоимость = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
			НовоеПолеСтоимость.Вид = ВидПоляФормы.ПолеВвода;
			НовоеПолеСтоимость.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	КонецЕсли;
	
КонецПроцедуры
//Конец
